app/controllers/ava_infos_controller.rb

SELECT "ava_infos".* FROM "ava_infos"
---
  def index
    @ava_infos = AvaInfo.all

INSERT INTO "ava_infos" ("pharmacy_id", "medicine_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["pharmacy_id", 1], ["medicine_id", 1], ["quantity", 5], ["created_at", "2017-04-27 22:57:50.681427"], ["updated_at", "2017-04-27 22:57:50.681427"]]
---
  def create
    @ava_info = AvaInfo.new(ava_info_params)

    respond_to do |format|
      if @ava_info.save

SELECT  "ava_infos".* FROM "ava_infos" WHERE "ava_infos"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_ava_info
      @ava_info = AvaInfo.find(params[:id])