app/controllers/medicines_controller.rb

SELECT "medicines".* FROM "medicines"
---
  def index
    @medicines = Medicine.all

INSERT INTO "medicines" ("medicine_name", "dosage", "quantity_or_volume", "manufacturer", "need_recipe", "price", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @medicine = Medicine.new(medicine_params)

    respond_to do |format|
      if @medicine.save

SELECT  "medicines".* FROM "medicines" WHERE "medicines"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_medicine
      @medicine = Medicine.find(params[:id])