app/controllers/pharmacies_controller.rb

SELECT "pharmacies".* FROM "pharmacies"
---
  def index
    @pharmacies = Pharmacy.all

INSERT INTO "pharmacies" ("adress", "number", "nearest_metro", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["adress", "Сосновый бор"], ["number", 1], ["nearest_metro", "Арбатская"], ["created_at", "2017-04-27 22:47:20.175591"], ["updated_at", "2017-04-27 22:47:20.175591"]]
---
  def create
    @pharmacy = Pharmacy.new(pharmacy_params)

    respond_to do |format|
      if @pharmacy.save

SELECT  "pharmacies".* FROM "pharmacies" WHERE "pharmacies"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_pharmacy
      @pharmacy = Pharmacy.find(params[:id])